In [1]:
%load_ext sql

In [2]:
%sql sqlite://

Connecting to 'sqlite://'

In [3]:
%%sql
CREATE TABLE employees (
    id int,
    emp_name varchar(100),
    salary int,
    dept_id int,
    manager_id int
);

INSERT INTO employees 
VALUES (1, 'Idris', 1000, 1, 1), (2, 'Aweda', 2000, 2, 2), (3, 'Zubair', 3000, 3, 2), (4, 'Young', 4000, 3, 3), (5, 'Babu', 5000, 1, 3), (6, 'John', 1000, 8, 1);

Running query in 'sqlite://'

6 rows affected.

++
||
++
++

In [4]:
%%sql
CREATE TABLE departments (
    id int,
    dept_name varchar(100)
);

INSERT INTO departments
VALUES (1, 'Engineering'), (2, 'Product'), (3, 'Marketing'), (4, 'Support');

Running query in 'sqlite://'

4 rows affected.

++
||
++
++

In [5]:
%%sql
CREATE TABLE managers (
    id int,
    manager_name varchar(100),
    dept_id int
);

INSERT INTO managers
VALUES (1, 'Doe', 1), (2, 'Jane', 2), (3, 'May', 4);

Running query in 'sqlite://'

3 rows affected.

++
||
++
++

In [6]:
%%sql
CREATE TABLE projects (
    id int,
    project_name varchar(100),
    emp_id int
);

INSERT INTO projects
VALUES (1, 'Fintech App', 1), (1, 'Fintech App', 5), (1, 'Fintech App', 6), (2, 'Cooking Website', 1), (2, 'Cooking Website', 2);

Running query in 'sqlite://'

5 rows affected.

++
||
++
++

In [7]:
%sql SELECT * from projects;

Running query in 'sqlite://'

+----+-----------------+--------+
| id |   project_name  | emp_id |
+----+-----------------+--------+
| 1  |   Fintech App   |   1    |
| 1  |   Fintech App   |   5    |
| 1  |   Fintech App   |   6    |
| 2  | Cooking Website |   1    |
| 2  | Cooking Website |   2    |
+----+-----------------+--------+

In [8]:
%sql SELECT * from managers;

Running query in 'sqlite://'

+----+--------------+---------+
| id | manager_name | dept_id |
+----+--------------+---------+
| 1  |     Doe      |    1    |
| 2  |     Jane     |    2    |
| 3  |     May      |    4    |
+----+--------------+---------+

In [9]:
%sql SELECT * from employees;

Running query in 'sqlite://'

+----+----------+--------+---------+------------+
| id | emp_name | salary | dept_id | manager_id |
+----+----------+--------+---------+------------+
| 1  |  Idris   |  1000  |    1    |     1      |
| 2  |  Aweda   |  2000  |    2    |     2      |
| 3  |  Zubair  |  3000  |    3    |     2      |
| 4  |  Young   |  4000  |    3    |     3      |
| 5  |   Babu   |  5000  |    1    |     3      |
| 6  |   John   |  1000  |    8    |     1      |
+----+----------+--------+---------+------------+

In [10]:
%sql SELECT * from departments;

Running query in 'sqlite://'

+----+-------------+
| id |  dept_name  |
+----+-------------+
| 1  | Engineering |
| 2  |   Product   |
| 3  |  Marketing  |
| 4  |   Support   |
+----+-------------+

In [11]:
%%sql
SELECT e.emp_name, d.dept_name
FROM employees e
INNER JOIN departments d ON e.dept_id = d.id;

Running query in 'sqlite://'

+----------+-------------+
| emp_name |  dept_name  |
+----------+-------------+
|  Idris   | Engineering |
|  Aweda   |   Product   |
|  Zubair  |  Marketing  |
|  Young   |  Marketing  |
|   Babu   | Engineering |
+----------+-------------+

In [12]:
%%sql
SELECT e.emp_name, m.manager_name
FROM employees e
LEFT JOIN managers m ON e.manager_id = m.id;

Running query in 'sqlite://'

+----------+--------------+
| emp_name | manager_name |
+----------+--------------+
|  Idris   |     Doe      |
|  Aweda   |     Jane     |
|  Zubair  |     Jane     |
|  Young   |     May      |
|   Babu   |     May      |
|   John   |     Doe      |
+----------+--------------+

In [13]:
%%sql
SELECT departments.dept_name, AVG(employees.salary) AS avg_salary
FROM departments
LEFT JOIN employees ON departments.id = employees.dept_id
GROUP BY departments.dept_name;

Running query in 'sqlite://'

+-------------+------------+
|  dept_name  | avg_salary |
+-------------+------------+
| Engineering |   3000.0   |
|  Marketing  |   3500.0   |
|   Product   |   2000.0   |
|   Support   |    None    |
+-------------+------------+

In [14]:
emp_dpt = %sql SELECT e.emp_name, d.dept_name FROM employees e INNER JOIN departments d ON e.dept_id = d.id;

Running query in 'sqlite://'

In [15]:
emp_dpt

+----------+-------------+
| emp_name |  dept_name  |
+----------+-------------+
|  Idris   | Engineering |
|  Aweda   |   Product   |
|  Zubair  |  Marketing  |
|  Young   |  Marketing  |
|   Babu   | Engineering |
+----------+-------------+